results/1/aj-Lenovo-G500s/wai-routes-0.7.0/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.96ms   59.32ms   1.67s    99.05%
    Req/Sec    16.08k     1.11k   19.86k    66.50%
  960802 requests in 30.04s, 150.27MB read
Requests/sec:  31980.52
Transfer/sec:      5.00MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.71ms   85.95ms   1.94s    98.70%
    Req/Sec    16.00k     3.82k   35.07k    87.00%
  955706 requests in 30.02s, 149.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:  31831.66
Transfer/sec:      4.98MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.41ms   76.96ms   1.87s    98.89%
    Req/Sec    16.26k     1.87k   26.53k    84.67%
  971186 requests in 30.04s, 151.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 127
Requests/sec:  32332.76
Transfer/sec:      5.06MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.59ms   78.17ms   1.76s    98.71%
    Req/Sec    15.59k     2.13k   25.31k    83.33%
  930812 requests in 30.02s, 145.58MB read
  Socket errors: connect 0, read 51, write 0, timeout 71
Requests/sec:  31010.93
Transfer/sec:      4.85MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.81ms   81.79ms   1.79s    98.55%
    Req/Sec    15.92k     2.84k   32.23k    94.17%
  950434 requests in 30.02s, 148.65MB read
  Socket errors: connect 0, read 60, write 0, timeout 21
Requests/sec:  31659.41
Transfer/sec:      4.95MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.20ms   85.19ms   1.89s    98.61%
    Req/Sec    15.91k     1.40k   20.50k    74.50%
  950206 requests in 30.02s, 148.61MB read
  Socket errors: connect 0, read 19, write 0, timeout 23
Requests/sec:  31654.83
Transfer/sec:      4.95MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.09ms  103.46ms   1.99s    98.20%
    Req/Sec    16.24k     2.15k   27.86k    86.67%
  969815 requests in 30.03s, 151.68MB read
Requests/sec:  32299.44
Transfer/sec:      5.05MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.04ms   86.47ms   1.99s    98.55%
    Req/Sec    15.84k     1.72k   21.53k    80.67%
  946499 requests in 30.03s, 148.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:  31516.57
Transfer/sec:      4.93MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.02ms   81.86ms   1.89s    98.87%
    Req/Sec    15.94k     2.13k   25.48k    80.33%
  952049 requests in 30.03s, 148.90MB read
  Socket errors: connect 0, read 5, write 0, timeout 134
Requests/sec:  31705.88
Transfer/sec:      4.96MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.76ms   84.06ms   1.99s    98.51%
    Req/Sec    15.50k     3.81k   35.74k    87.46%
  922770 requests in 30.04s, 144.32MB read
  Socket errors: connect 0, read 83, write 0, timeout 41
Requests/sec:  30721.58
Transfer/sec:      4.80MB
=================== summary ===================
machine:      aj-Lenovo-G500s
ghc version:  7.8.4
bench target: wai-routes-0.7.0
bench:        DEEP
bench mode:   30s * 10
average:      31671.36
stdev:        507.39
=================== oneline ===================
aj-Lenovo-G500s,7.8.4,wai-routes-0.7.0,DEEP,30s,10,31671.36,507.39